[
  {
    "title": "Fullstack Mobile Developer",
    "company": "WorkFlow Careers.",
    "startDate": "Nov 2024",
    "endDate": null,
    "description": "I reimagine the job application process by leveraging innovative tools like AI to showcase a more personal and transparent view of every candidate. This approach ensures that no talent goes unnoticed while helping organizations see beyond polished but misleading resumes. By combining technology and empathy, I enable hiring teams to uncover hidden potential, streamline decisions, and build more authentic, high-performing teams.",
    "skills": ["React Native", "Cloud Firestore", "State Management", "Cross-platform Development", "AI"]
  },
  {
    "title": "AI Software Developer",
    "company": "Reality AI Lab.",
    "startDate": "Jun 2024",
    "endDate": "Oct 2024",
    "description": "I had the privilege of developing AI solutions for educational purposes and connecting with diverse individuals to foster a global community dedicated to inclusive and sustainable education. Together, we created innovative tools that empower learners to adapt and thrive in a rapidly changing world. This experience allowed me to combine my passion for technology with a mission to make quality education accessible to all, driving meaningful impact and inspiring lifelong learning.",
    "skills": ["Google Gemini", "LangChain", "Python", "Generative AI", "OpenAI"]
  },
  {
    "title": "Lead Software Developer",
    "company": "The Tech Cadets",
    "startDate": "Jun 2018",
    "endDate": "Feb 2020",
    "description": "At The Tech Cadets, I led a team of tech enthusiasts in a supportive environment to create impactful solutions focused on sustainability and educational technologies. I played a key role in transforming ideas into prototypes and fully functional products, presenting these innovations to stakeholders to showcase their potential and impact. This experience sharpened my technical expertise, enhanced my collaboration skills, and deepened my ability to communicate and deliver meaningful solutions.",
    "skills": ["Flutter", "Gemini AI", "Project Management", "Firebase", "Cross-platform Development"]
  },
  {
    "title": "Junior Android App Developer",
    "company": "Comité Creativo",
    "startDate": "Jan 2022",
    "endDate": "Aug 2022",
    "description": "I collaborated on the Open Data Kit projects, resolving GitHub issues and ensuring seamless integration with backend services.",
    "skills": ["Java", "Kotlin", "Android Studio", "GitHub", "Agile"]
  }
]
